Repository: argrath/activitystreams
Catalog: omegat/omegat/project_save.tmx
Source language: en
Languages: ja

source: (a) the object contains a type property whose value includes "Link"
ja: (a) 値が "Link" である type 属性を持つオブジェクト、

source: (a) the object contains a type property whose value includes "Link" or (b) any of the types included in the value of the type property are defined as extensions of Link (see Mention for instance); otherwise the JSON object is considered an instance or extension of Object.
ja: (a) 値が "Link" である type 属性を持つオブジェクト、 または (b) type 属性の値が、Link の拡張として定義されている型 (例えば、 Mention を参照のこと); さもなければこの JSON オブジェクトは Object の実体または 拡張である。

source: 1. Introduction
ja: 1. 概要

source: 1.1 Conventions
ja: 1.1規約

source: 1.1 Relationship to Other Social Standards
ja: 1.1 他のソーシャル標準との関係

source: 1.2 Relationship to JSON Activity Streams 1.0
ja: 1.2 JSON Activity Streams 1.0 との関係

source: 2. Core Types
ja: 2.コア型

source: 2. Serialization
ja: 2. 直列化

source: 2.1.1 Context with a string
ja: 2.1.1 文字列のコンテキスト

source: 2.1.2 Context with an object
ja: 2.1.2 オブジェクトのコンテキスト

source: 2.1.3 Context with an array
ja: 2.1.3 配列のコンテキスト

source: 2.2 IRIs and URLs
ja: 2.2 IRI と URL

source: 2.3 Date and Times
ja: 2.3 日付と時刻

source: 3. Examples
ja: 3. 例

source: 3. Extended Types
ja: 3.拡張型

source: 3.1 Activity Types
ja: 3.1 アクティビティ型

source: 3.1 Minimal Activity
ja: 3.1 最小限のアクティビティ

source: 3.2 Actor Types
ja: 3.2 アクター型

source: 3.2 Basic activity with some additional detail
ja: 3.2 追加の詳細付きの基本的なアクティビティ

source: 3.3 An extended activity
ja: 3.3 拡張したアクティビティ

source: 3.3 Object and Link Types
ja: 3.3オブジェクト型とリンク型

source: 4. Model
ja: 4. モデル

source: 4. Properties
ja: 4.属性

source: 4.1.1 Text representations of Object types
ja: 4.1.1 オブジェクト型のテキスト表現

source: 4.6.1 Collection Paging
ja: 4.6.1 コレクションのページング

source: 4.7 Natural Language Values
ja: 4.7 自然言語値

source: 4.7.1 Default Language Context
ja: 4.7.1 デフォルト言語コンテキスト

source: 4.7.2 Bidirectional Text
ja: 4.7.2 双方向テキスト

source: 4.8 Marking up language
ja: 4.8 言語のマークアップ

source: 5. Extensibility
ja: 5 拡張性

source: 5. Implementation Notes
ja: 5.実装の注意点

source: 5.1 Audience Targeting
ja: 5.1 関係者指定

source: 5.1 Support for Compact URIs
ja: 5.1 Compact URI対応

source: 5.2 Re-serialization of Extensions
ja: 5.2 拡張の再直列化

source: 5.2 Representing Relationships Between Entities
ja: 5.2 エンティティ間の関連の表現

source: 5.3 Representing Places
ja: 5.3 場所の表現

source: 5.4 Representing Questions
ja: 5.4 質問の表現

source: 5.5 Inverse Activities and "Undo"
ja: 5.5 逆アクティビティと "Undo"

source: 5.6 Mentions, Tags and Other Common Social Microsyntaxes
ja: 5.6 言及、タグおよびその他の一般的なソーシャルマイクロ文法

source: 5.7 Origin and Target
ja: 5.7 origin と target

source: 5.8 Activity Type Motivating Use Cases
ja: 5.8アクティビティ型の動機づけとなるユースケース

source: 6. Privacy Considerations
ja: 6. プライバシー上の考慮事項

source: 7. Security Considerations
ja: 7. セキュリティ上の考慮事項

source: 8. IANA Considerations
ja: 8. IANAの考慮事項

source: 8.1 The application/activity+json Media Type
ja: 8.1 application/activity+json メディア型

source: 9. Conformance
ja: 9. 適合性

source: 9.1 Documents
ja: 9.1文書

source: 9.2 Implementations
ja: 9.2 実装

source: 9.2.1 Publishers
ja: 9.2.1 発行者

source: 9.2.2 Consumers
ja: 9.2.2 消費者

source: A. Acknowledgements
ja: A. 謝辞

source: A. Non-normative Ontology Definition
ja: A. 非規範的オントロジー定義

source: B. Changelog
ja: B. 変更履歴

source: B. Deprecated Activity Streams 1.0 Syntax
ja: B. 廃止されたActivity Streams 1.0文法

source: C. Example using Multiple Vocabularies
ja: C. 複数の語彙を使った例

source: C. References
ja: C. 参考文献

source: C.1 Normative references
ja: C.1 引用規格

source: C.2 Informative references
ja: C.2 参考規格

source: CollectionPage, and
ja: CollectionPage,

source: D. Changelog
ja: D. 変更履歴

source: E. Table of Figures
ja: E. 図の一覧

source: F. References
ja: F. 参考文献

source: F.1 Normative references
ja: F.1 引用規格

source: F.2 Informative references
ja: F.2 参考規格

source: Abstract
ja: 要約

source: Activity Types
ja: アクティビティ型

source: Actor Types
ja: アクター型

source: Author's Note
ja: 著者のメモ

source: Collection objects are a specialization of the base Object that serve as a container for other Objects or Links.
ja: Collection オブジェクトは、 他の Object や Link の コンテナとして動作する基底 Object の特化である。

source: Copyright © 2017 W3C® (MIT, ERCIM, Keio, Beihang).
ja: Copyright © 2018 W3C® (MIT, ERCIM, Keio, Beihang).

source: Note: Examples
ja: 注: 例

source: Object Types
ja: オブジェクト型

source: Status of This Document
ja: この文書の状態

source: Table of Contents
ja: 目次

source: The Activity Streams 2.0 Core Syntax defines the JSON syntax for Activity Streams.
ja: The Activity Streams 2.0 Core Syntax は Activity Streams のための JSON 文法を定義する。

source: This section describes the status of this document at the time of its publication.
ja: この節は、発行時点でのこの文書の状態を説明している。

source: This section is non-normative.
ja: この節は非規範的である。

source: W3C maintains a public list of any patent disclosures made in connection with the deliverables of the group; that page also includes instructions for disclosing a patent.
ja: W3Cは、グループの成果物に関連して作成された特許開示の公開リストを保守しており、そのページには特許を開示するための手順も含まれている。

source: W3C's role in making the Recommendation is to draw attention to the specification and to promote its widespread deployment.
ja: この勧告を作成する上でのW3Cの役割は、仕様に注意を喚起し、その広範な展開を促進することである。

source: A "Compact URI" is an alternative encoding of a URI that uses a defined prefix to simplify serialization.
ja: "Compact URI"は、直列化を単純化するために定義された接頭辞を使用するURIの代替エンコーディングである。

source: A Collection is a subtype of Object that represents ordered or unordered sets of Object or Link instances.
ja: Collection は、 Object または Link 実体の、 順序付きまたは順序なしの集合を表現する、 Object の派生型である。

source: A Link describes a qualified, indirect reference to another resource that is closely related to the conceptual model of Links as established in [RFC5988].
ja: Link は、修飾された、他のリソースへの間接参照であり、 [RFC5988] で設定された Links の概念モデルと深く関係している。

source: A Collection can contain a large number of items.
ja: Collection は大量のアイテムを含むことができる。

source: A Core set of properties describing the generalized structure of an Activity; and
ja: アクティビティの一般化された構造を記述する、コア属性の集合、および

source: A JSON object in the Activity Streams 2.0 document is a Link if either:
ja: Activity Streams 2.0 文書の中の JSON オブジェクトは、次のどちらかの場合に Linkである:

source: A JSON object in the Activity Streams 2.0 document is a Link if either: (a) the object contains a type property whose value includes "Link" or (b) any of the types included in the value of the type property are defined as extensions of Link (see Mention for instance); otherwise the JSON object is considered an instance or extension of Object.
ja: Activity Streams 2.0 文書の中の JSON オブジェクトは、次のどちらかの場合に Link である: (a) 値が "Link" である type 属性を持つオブジェクト、 または (b) type 属性の値が、Link の拡張として定義されている型 (例えば、 Mention を参照のこと); さもなければこの JSON オブジェクトは Object の実体または 拡張である。

source: A Link is an indirect, qualified reference to a resource identified by a URL.
ja: Link は、URL で識別される、リソースへの間接的な修飾された参照である。

source: A Tombstone represents a content object that has been deleted.
ja: Tombstone は、削除された content object を表現する。

source: A bridge from a non-conforming social network
ja: 非適合ソーシャルネットワークからのブリッジ

source: A document converter from similar document types such as RSS or Atom
ja: RSSやAtomのような似たような文書型からの文書コンバータ

source: A document publishing system
ja: 文書発行システム

source: A document representing a collection of the activities addressed to an actor or object
ja: アクターまたはオブジェクトにアドレス指定されたアクティビティのコレクションを表す文書

source: A document representing a collection of the activities done by an actor
ja: アクターによって行われたアクティビティのコレクションを表現する文書

source: A document representing a collection of the activities done to an object
ja: オブジェクトに行われたアクティビティのコレクションを表現する文書

source: A document representing an activity
ja: アクティビティを表現する文書

source: A document representing an actor
ja: アクターを表現する文書

source: A document representing an object
ja: オブジェクトを表現する文書

source: A document validator
ja: 文書バリデータ

source: A feed aggregator
ja: フィードアグリゲータ

source: A feed reader
ja: フィードリーダ

source: A list of current W3C publications and the latest revision of this technical report can be found in the W3C technical reports index at https://www.w3.org/TR/.
ja: 現在の W3C による発行物と この技術報告の最新版は https://www.w3.org/TR/ の W3C technical reports index にある。

source: A non-exhaustive list of example consumers includes:
ja: 消費者の例の非網羅的なリストには、以下が含まれる:

source: A non-exhaustive list of example publishers includes:
ja: 発行者の例の非網羅的なリストには、以下が含まれる:

source: A non-exhaustive list of examples of documents includes:
ja: 文書の例の非網羅的なリストには、以下が含まれる:

source: A page is identified using the CollectionPage type.
ja: ページは CollectionPage 型を使って識別される。

source: A personal web site
ja: 個人的なwebサイト

source: A search engine
ja: 検索エンジン

source: A simple, human-readable, plain-text name for the object.
ja: このオブジェクトの、単純で、人間可読な、プレーンテキスト名。

source: A social network
ja: ソーシャルネットワーク

source: A specialization of Accept indicating that the acceptance is tentative.
ja: Accept の特化で、受け入れが一時的であることを示す。

source: A specialized Link that represents an @mention.
ja: @mention を表現する Link の特化。

source: A statistical analyzer
ja: 静的アナライザ

source: A subtype of Collection in which members of the logical collection are assumed to always be strictly ordered.
ja: 論理的なコレクションのメンバーが常に厳密に順序づけされていることが 仮定されている、Collection の派生型。

source: A typical social software implementation would typically render such a content such that "@sally" is replaced with a hyperlink to "@sally"'s social profile page and "#givingthanks" is replaced with a hyperlink to a listing of other notes that have been "tagged" with the same topic.
ja: 典型的なソーシャルソフトウェア実装は典型的にはこのようなコンテンツを、 "@sally" を "@sally" のソーシャルプロフィールページへの ハイパーリンクに置き換え、"#givingthanks" を 同じトピックに「タグ付け」された他のメッセージの一覧への ハイパーリンクに置き換える。

source: A typical way this message would appear within the content of a note is shown below:
ja: このメッセージがメモの内容の中に現れる典型的な方法を以下に示す:

source: Accordingly, implementations that rely too heavily on the use of extensions may experience reduced interoperability with other implementations.
ja: したがって、拡張の使用に過度に依存する実装は、他の実装との相互運用性の低下を経験する可能性がある。

source: Accordingly, in the JSON serialization, the terms " name", "summary", and "content" represent the JSON string forms; and the terms " nameMap", "summaryMap", and " contentMap" for represent the object forms.
ja: それぞれ、JSON シリアル化では " name", "summary", and "content" は JSON 文字列形式を表現する; "nameMap", "summaryMap", "contentMap" は オブジェクト形式を表現する。

source: Activity Streams 1.0 was a community driven effort and the specification would not be where it is today without the earlier contributions from the community, including, but not limited to: Abdul Qabiz, Adina Levin, Adrian Chan, Adriana Javier, Alan Hoffman, Alex Kessinger, Alexander Ovchinnikov, Alexander Zhuravlev, Alexandre Loureiro Solleiro, Amy Walgenbach, Andres Vidal, Angel Robert Marquez, Ari Steinberg, Arjan Scherpenisse, Arne Roomann-Kurrik, Beau Lebens, Ben Hedrington, Ben Metcalfe, Ben Werdmuller, Benjamin Goering, Bill de hOra, Bo Xing, Bob Aman, Bob Wyman, Brett Slatkin, Brian Walsh, Brynn Evans, Charlie Cauthen, Chris Chabot, Chris Messina, Chris Toomey, Christian Crumlish, Dan Brickley, Dan Scott, Daniel Chapman, Danny Ayers, Dare Obasanjo, Darren Bounds, David Cramer, David Nelson, David Recordon, DeWitt Clinton, Douglas Pearce, Ed Summers, Elias Bizannes, Elisabeth Norris, Eric Marcoullier, Eric Woods, Evan Prodromou, Gee-Hsien Chuang, Greg Biggers, Gregory Foster, Henry Saputra, Hillary Madsen, Howard Liptzin, Hung Tran, Ian Kennedy, Ian Mulvany, Ivan Pulleyn, Jacob Kim, James Falkner, James Pike, James Walker, Jason Kahn, Jason Kantz, Jeff Kunins, Jeff Martin, Jian Lin, Johannes Ernst, John Panzer, Jon Lebkowsky, Jon Paul Davies, Jonathan Coffman, Jonathan Dugan, Joseph Boyle, Joseph Holsten, Joseph Smarr, Josh Brewer, Jud Valeski, Julien Chaumond, Julien Genestoux, Jyri Engestroem, Kaliya Hamlin, Kevin Marks, Laurent Eschenauer, Laurie Voss, Leah Culver, Libby Miller, Manu Mukerji, Mark Weitzel, Marko Degenkolb, Marshall Kirkpatrick, Martin Atkins, Martin Svensson, Marty Alchin, Mary Hoder, Matt Leventi, Matt Wilkinson, Matthias Mueller-Prove, Max Engel, Max Wegmueller, Melvin Carvalho, Michael Buckbee, Michael Chan, Michael Richardson, Michael Sullivan, Mike Macgirvin, Mislav Marohnić, Mo Jangda, Monica Wilkinson, Nate Benes, NeilFred Picciotto, Nick Howard, Nick Lothian, Nissan Dookeran, Nitya Narasimhan, Pablo Martin, Padraic Brady, Pat Cappelaere, Patrick Aljord, Peter Ferne, Peter Reiser, Peter Saint-Andre, Phil Wolff, Philip (flip) Kromer, Richard Cunningham, Richard Zhao, Rick Severson, Robert Hall, Robert Langbert, Robert Dolin, Robin Cover, Ryan Boyd, Sam Sethi, Scott Raymond, Scott Seely, Simon Grant, Simon Wistow, Stephen Garcia, Stephen Sisk, Stephen Paul Weber, Steve Ivy, Steve Midgley, Steven Livingstone-Perez, Sylvain Carle, Sylvain Hellegouarch, Tantek Çelik, Tatu Saloranta, Tim Moore, Timothy Young, Todd Barnard, Tosh Meston, Tyler Gillies, Will Norris, Zach Copley, Laurent-Walter Goix, Matthew Marum, Andy Smith, and Zach Shepherd.
ja: Activity Streams 1.0はコミュニティ主導の活動であり、次の方々を含む(しかしそれに限定されない)コミュニティからの初期の貢献がなければ、仕様は現在のような形にはならなかった: Abdul Qabiz, Adina Levin, Adrian Chan, Adriana Javier, Alan Hoffman, Alex Kessinger, Alexander Ovchinnikov, Alexander Zhuravlev, Alexandre Loureiro Solleiro, Amy Walgenbach, Andres Vidal, Angel Robert Marquez, Ari Steinberg, Arjan Scherpenisse, Arne Roomann-Kurrik, Beau Lebens, Ben Hedrington, Ben Metcalfe, Ben Werdmuller, Benjamin Goering, Bill de hOra, Bo Xing, Bob Aman, Bob Wyman, Brett Slatkin, Brian Walsh, Brynn Evans, Charlie Cauthen, Chris Chabot, Chris Messina, Chris Toomey, Christian Crumlish, Dan Brickley, Dan Scott, Daniel Chapman, Danny Ayers, Dare Obasanjo, Darren Bounds, David Cramer, David Nelson, David Recordon, DeWitt Clinton, Douglas Pearce, Ed Summers, Elias Bizannes, Elisabeth Norris, Eric Marcoullier, Eric Woods, Evan Prodromou, Gee-Hsien Chuang, Greg Biggers, Gregory Foster, Henry Saputra, Hillary Madsen, Howard Liptzin, Hung Tran, Ian Kennedy, Ian Mulvany, Ivan Pulleyn, Jacob Kim, James Falkner, James Pike, James Walker, Jason Kahn, Jason Kantz, Jeff Kunins, Jeff Martin, Jian Lin, Johannes Ernst, John Panzer, Jon Lebkowsky, Jon Paul Davies, Jonathan Coffman, Jonathan Dugan, Joseph Boyle, Joseph Holsten, Joseph Smarr, Josh Brewer, Jud Valeski, Julien Chaumond, Julien Genestoux, Jyri Engestroem, Kaliya Hamlin, Kevin Marks, Laurent Eschenauer, Laurie Voss, Leah Culver, Libby Miller, Manu Mukerji, Mark Weitzel, Marko Degenkolb, Marshall Kirkpatrick, Martin Atkins, Martin Svensson, Marty Alchin, Mary Hoder, Matt Leventi, Matt Wilkinson, Matthias Mueller-Prove, Max Engel, Max Wegmueller, Melvin Carvalho, Michael Buckbee, Michael Chan, Michael Richardson, Michael Sullivan, Mike Macgirvin, Mislav Marohnić, Mo Jangda, Monica Wilkinson, Nate Benes, NeilFred Picciotto, Nick Howard, Nick Lothian, Nissan Dookeran, Nitya Narasimhan, Pablo Martin, Padraic Brady, Pat Cappelaere, Patrick Aljord, Peter Ferne, Peter Reiser, Peter Saint-Andre, Phil Wolff, Philip (flip) Kromer, Richard Cunningham, Richard Zhao, Rick Severson, Robert Hall, Robert Langbert, Robert Dolin, Robin Cover, Ryan Boyd, Sam Sethi, Scott Raymond, Scott Seely, Simon Grant, Simon Wistow, Stephen Garcia, Stephen Sisk, Stephen Paul Weber, Steve Ivy, Steve Midgley, Steven Livingstone-Perez, Sylvain Carle, Sylvain Hellegouarch, Tantek Çelik, Tatu Saloranta, Tim Moore, Timothy Young, Todd Barnard, Tosh Meston, Tyler Gillies, Will Norris, Zach Copley, Laurent-Walter Goix, Matthew Marum, Andy Smith, Zach Shepherd。

source: Activity Streams 2.0 documents MUST be serialized using the UTF-8 character encoding.
ja: Activity Streams 2.0 文書は UTF-8 文字エンコーディングを使って 直列化しなければならない(MUST)。

source: Activity Streams 2.0 implementations that wish to fully support extensions MUST support Compact URI expansion as defined by the JSON-LD specification.
ja: 拡張に完全に対応することを望むActivity Streams 2.0実装は、JSON-LD仕様で定義されているCompact URI展開に対応しなければならない(MUST)。

source: Activity Streams 2.0 is suitable as a social data syntax.
ja: Activity Streams 2.0 はソーシャルデータ文法に適している。

source: Activity Streams 2.0 publishers SHOULD explicitly mark the language of natural language properties if they are known, using either map properties or a default language tag.
ja: Activity Streams 2.0 発行者は、分かっている場合には、map 属性か デフォルト言語タグを使って、自然言語属性の言語を明示的に マークアップするべきである(SHOULD)。

source: Activity Streams are JSON Documents and are subject to the same security considerations described in [RFC7159].
ja: Activity StreamsはJSON文書であり、[RFC7159]で説明されているのと同じセキュリティ上の考慮事項に従う。

source: Activity Streams consumers often need a text representation of an Activity Streams object, e.g. for display in a Web browser or console interface.
ja: Activity Streams 消費者はしばしば、 例えば Web ブラウザやコンソールインターフェースに表示するために、 Activity Streams オブジェクトのテキスト表現を必要とする。

source: Activity Streams implementations handle IRIs.
ja: Activity Streamsの実装はIRIを扱う。

source: Activity Streams implementations handle URIs.
ja: Activity Streamsの実装はURIを扱う。

source: Activity objects are specializations of the base Object type that provide information about actions that have either already occurred, are in the process of occurring, or may occur in the future.
ja: Activity オブジェクトは、既に起きた、今起きている途中、 将来起きるかもしれないアクションに関する情報を提供する、 基底 Object 型の特化である。

source: Actor objects are specializations of the base Object type that represent entities capable of carrying out an Activity.
ja: Actor オブジェクトは、 Activity を実行する能力を持つ実体を表現する、基底 Object 型の特化である。

source: Actor types are Object types that are capable of performing activities.
ja: アクター型はアクティビティを実行する能力を持つ Object 型である。

source: Added datetime and boolean to range of closed property.
ja: closed属性の範囲にdatetimeおよびbooleanを追加した。

source: All Actor objects are specializations of Object and inherit all of the core properties common to all Objects.
ja: 全ての Actor オブジェクトは Object の特化であり、 全ての Object に共通の全てのコア属性を継承する。

source: All diagrams, examples, and notes in this specification are non-normative, as are all sections explicitly marked non-normative.
ja: この仕様における、非規範的とされている節および、全ての図、例、注記は非規範的である。

source: All other types defined in the Activity Vocabulary, as well as all extension types, are derived from these two base types.
ja: Activity Vocabulary に定義されているそれ以外の型は、全ての拡張型を含めて、 これら二つの基底型の派生である。

source: All properties are optional (including the id and type).
ja: (id と type を含めて) 全ての属性は オプションである。

source: All properties with date and time values MUST conform to the "date-time" production in [RFC3339] with the one exception that seconds MAY be omitted.
ja: 全ての日付と時刻の属性は [RFC3339] の "date-time" 生成に従わなければならない(MUST); 但し例外として秒は省略しても良い(MAY)。

source: An IntransitiveActivity that indicates that the actor has arrived at the location.
ja: actor が location に到着したことを示す IntransitiveActivity。

source: An Activity Streams Document is a JSON document whose root value is an Activity Streams Object of any type, including a Collection, and whose MIME media type is " application/activity+json".
ja: Activity Streams 文書 とは、ルート値が (Collection を含む)任意の型の Activity Streams Object で、 MIME メディアタイプが "application/activity+json" である JSON 文書である。

source: An Activity is a subtype of Object that describes some form of action that may happen, is currently happening, or has already happened.
ja: Activity は、起こる予定、今起こっている、既に起こったある種の型式の アクションを記述する、Object の派生型である。

source: An Extended set of properties that cover specific types of Activities and Artifacts common to many social Web application systems.
ja: 多くのソーシャル Web アプリケーションで一般的な、特定のアクティビティと アーティファクトをの型を扱う、拡張属性の集合

source: An image document of any kind
ja: あらゆる種類の画像

source: An implementation that wishes, for example, to use a http://purl.org/goodrelations/v1#Location as an object type MUST also identify the object as being a Place as illustrated in the following:
ja: 例えば、http://purl.org/goodrelations/v1#Locationをオブジェクト型として使用したい実装は、以下に示すように、そのオブジェクトをPlaceとしても識別しなければならない。

source: An implementation that wishes, for example, to use a vcard:Individual as an Actor MUST also identify that Actor as a Person as illustrated in the previous example.
ja: 例えば、vcard:Individualをアクターとして使いたい実装は、前の例で説明したように、そのアクターをPersonとしても識別しなければならない。

source: An individual who has actual knowledge of a patent which the individual believes contains Essential Claim(s) must disclose the information in accordance with section 6 of the W3C Patent Policy.
ja: Essential Claim(s)を含むと信じる特許について実際の知識を有する者は、W3C Patent Policy第6条に従って情報を開示しなければならない。

source: An uppercase "T" character MUST be used to separate date and time, and an uppercase "Z" character MUST be used in the absence of a numeric time zone offset.
ja: 日付と時刻を分けるために大文字の "T" を使わなければならず(MUST)、 タイムゾーンオフセット値がない場合は大文字の "Z" を 使わなければならない(MUST)。

source: Any given Link can have multiple link relation values.
ja: 任意のLinkは、複数のリンク関係値を持つことができる。

source: Any given object might have multiple such visual representations -- multiple screenshots, for instance, or the same image at different resolutions.
ja: 任意のオブジェクトは、複数のそのような視覚的表現、例えば、複数のスクリーンショット、または異なる解像度での同じ画像を保持することができる。

source: As defined in this specification.
ja: この仕様で定義している通り。

source: As with Collection objects, the items within a CollectionPage might be ordered or unordered.
ja: Collection オブジェクトと同様、 CollectionPage の中のアイテムは順序ありと順序なしの場合がある。

source: Because Activity Streams 2.0 can be considered a restricted profile of JSON-LD, Implementations SHOULD consider the `application/ld+json; profile="https://www.w3.org/ns/activitystreams"` media type as being equivalent to `application/activity+json`.
ja: Activity Streams 2.0 は JSON-LD の制限されたプロファイルと考えることも 出来るため、実装は `application/ld+json; profile="https://www.w3.org/ns/activitystreams"` メディアタイプを `application/activity+json` と等価なものとして 扱うべきである(SHOULD)。

source: By default, the value of content is HTML.
ja: デフォルトでは、content の値は HTML である。

source: Care should be taken to not unduly overlap with or duplicate the existing Activity types.
ja: 既存のアクティビティ型と過度に重なったり、複製したりしないように注意すること。

source: Care should be taken to not unduly overlap with or duplicate the existing Actor types.
ja: 既存のアクター型と過度に重なったり、複製したりしないように注意すること。

source: Care should be taken to not unduly overlap with or duplicate the existing Object types.
ja: 既存のObject型と過度に重なったり、重複したりしないように注意するべきである。

source: Certain properties defined by some External Vocabularies can overlap or duplicate those defined by the Activity Vocabulary.
ja: 外部語彙で定義されている属性は、 Activity Vocabulary で定義されている属性と重複および複製できる。

source: Changed examples to use terms from the Relationship vocabulary.
ja: Relationship語彙から用語を使うように例を変更した。

source: Comments regarding this document are welcome.
ja: この文書に関するコメントを歓迎する。

source: Compatibility with JSON-LD
ja: JSON-LD との互換性

source: Conforming documents are those that comply with all the conformance criteria for documents.
ja: 適合文書とは、文書のすべての適合基準に適合する文書である。

source: Consistent collection and paging representation
ja: 一貫したコレクションとページング表現

source: Consumer implementations SHOULD have fallback strategies for text representation of Objects in these cases.
ja: 消費者実装はこれらの場合の Object のテキスト表現に対する フォールバック戦略を持つべきである(SHOULD)。

source: Consuming implementations that encounter unfamiliar extensions MUST NOT stop processing or signal an error and MUST continue processing the items as if those properties were not present.
ja: 未知の拡張に遭遇した消費実装は、処理を停止したりエラーを通知したりしてはならず(MUST NOT)、それらの属性が存在しないかのようにアイテムの処理を継続しなければならない(MUST)。

source: Describes a relationship between two individuals.
ja: 二人の個人の間の関係を記述する。

source: Describes an object of any kind.
ja: 任意の型のオブジェクトを記述する。

source: Direction
ja: 方向

source: Disjoint With:
ja: 排他:

source: Each example is shown using the normative JSON serialization defined by this specification.
ja: それぞれの例は、この仕様で定義されてい標準 JSON 直列化を使って示している。

source: Every JSON object in an Activity Streams 2.0 document is either an Object or a Link.
ja: Activity Streams 2.0 で定義されている全ての JSON オブジェクトは、 Object か Link である。

source: Every URI [RFC3986] is also an IRI, so a URI may be used wherever an IRI is named.
ja: 全ての URI [RFC3986] は IRI でもあるので、IRI という名前が付いているところでは URL を使うことが出来る。
